Revit 2025 API
CeramicBumpType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicBump" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CeramicBumpType
Public Enumeration CeramicBumpType
public enum class CeramicBumpType
type CeramicBumpType
Members
Member name | Value | Description
None | 0
Wavy | 1
Custom | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace